frontend/load-test.yaml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 100

scenarios:
  - flow:
      - post:
          url: '/car-owner/register'
          json:
            name: 'John Doe'
            email: 'john.doe@example.com'
            phoneNumber: '1234567890'
            vehicleModel: 'Toyota Prius'
            licensePlate: 'ABC123'